export const icTypesIdByName = {
  Проститутка: 0,
  Массажистка: 1,
  BDSM: 2,
}

export const icKnownRows = [
  'Телефон',
  'Город',
  'Возраст',
  'Грудь',
  'Вес',
  'Рост',
  'Размер одежды',
  'Размер обуви',
  'Интимная стрижка',
  'Район',
  'Метро',
  'Номер анкеты',
  'Дата обновления',
  'E-mail',
  'Только для',
  'Вэб-адрес',
  'Массирую на',
  'Не моложе',
  'Не старше',
  'Рейтинг',
  'Адрес',
]

export const icRestrictionMessage =
  'Просмотр архивных анкет доступен только зарегистрированным пользователям'

export const icIdRangesByYear = new Map([
  [2003, [     0,   7098]],
  [2004, [  7114,  14793]],
  [2005, [ 14794,  24615]],
  [2006, [ 24617,  37366]],
  [2007, [ 37367,  50088]],
  [2008, [ 50090,  70329]],
  [2009, [ 70330,  91542]],
  [2010, [ 91543, 108814]],
  [2011, [108816, 127368]],
  [2012, [127369, 150385]],
  [2013, [150386, 179516]],
  [2014, [179520, 214807]],
  [2015, [214809, 255306]],
  [2016, [255309, 283172]],
  [2017, [283178, 309587]],
  [2018, [309604, 341363]],
  [2019, [341366, 383875]],
  [2020, [383877, 421804]],
  [2021, [421807, 465566]],
  [2022, [465567,       ]],
]);
