export const icTypesIdByName = {
  Проститутка: 0,
  Массажистка: 1,
  BDSM: 2,
}

export const icKnownRows = [
  'Телефон',
  'Город',
  'Возраст',
  'Грудь',
  'Вес',
  'Рост',
  'Размер одежды',
  'Размер обуви',
  'Интимная стрижка',
  'Район',
  'Метро',
  'Номер анкеты',
  'Дата обновления',
  'E-mail',
  'Только для',
  'Вэб-адрес',
  'Массирую на',
  'Не моложе',
  'Не старше',
  'Рейтинг',
  'Адрес',
]

export const icRestrictionMessage = 'Просмотр архивных анкет доступен только зарегистрированным пользователям'
